#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-YifdBe7ZKP3s6kS8

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-00530d07d703d9ec1]
aws_lb.lab: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/development-load-balancer/2ec156ad6d335489]
aws_s3_bucket.lab: Refreshing state... [id=my-tf-test-bucket-kpasdass8838s8dfsd8f93sdf]
aws_subnet.lab-public-1: Refreshing state... [id=subnet-002e9d330eddeb30d]
aws_internet_gateway.lab: Refreshing state... [id=igw-0e4bacbc0b0cb4eba]
aws_subnet.lab-public-2: Refreshing state... [id=subnet-0d3391804baad62c3]
aws_lb_target_group.lab: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151]
aws_subnet.lab-public-0: Refreshing state... [id=subnet-0f938a911467c9bd1]
aws_security_group.lab: Refreshing state... [id=sg-027b22860f8854f56]
aws_route_table.lab: Refreshing state... [id=rtb-0bbb2096df58b721e]
aws_instance.EC2-1: Refreshing state... [id=i-0bcb7bd6e3dd76507]
aws_instance.EC2-2: Refreshing state... [id=i-03e8babefc57a86b0]
aws_instance.EC2-0: Refreshing state... [id=i-09f8c1a75583a4560]
aws_route_table_association.public-access-0: Refreshing state... [id=rtbassoc-076271fc7007a2deb]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-09809330a6e87afe5]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-0a550610ceb14231a]
aws_lb_target_group_attachment.lab-0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162801431400000005]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162811270800000006]
aws_lb_target_group_attachment.lab-2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162751786900000004]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.EC2-0 has changed
  ~ resource "aws_instance" "EC2-0" {
      ~ associate_public_ip_address          = true -> false
        id                                   = "i-09f8c1a75583a4560"
      ~ instance_state                       = "running" -> "stopped"
      - public_dns                           = "ec2-44-211-43-39.compute-1.amazonaws.com" -> null
      - public_ip                            = "44.211.43.39" -> null
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
        # (28 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-1 has changed
  ~ resource "aws_instance" "EC2-1" {
      ~ associate_public_ip_address          = true -> false
        id                                   = "i-0bcb7bd6e3dd76507"
      ~ instance_state                       = "running" -> "stopped"
      - public_dns                           = "ec2-3-87-158-94.compute-1.amazonaws.com" -> null
      - public_ip                            = "3.87.158.94" -> null
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
        # (28 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_instance.EC2-2 has changed
  ~ resource "aws_instance" "EC2-2" {
      ~ associate_public_ip_address          = true -> false
        id                                   = "i-03e8babefc57a86b0"
      ~ instance_state                       = "running" -> "stopped"
      - public_dns                           = "ec2-34-238-143-166.compute-1.amazonaws.com" -> null
      - public_ip                            = "34.238.143.166" -> null
      ~ security_groups                      = [
          - "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
        # (28 unchanged attributes hidden)







        # (7 unchanged blocks hidden)
    }

  # aws_lb.lab has changed
  ~ resource "aws_lb" "lab" {
      + arn                                         = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/development-load-balancer/2ec156ad6d335489"
      + arn_suffix                                  = "app/development-load-balancer/2ec156ad6d335489"
      + dns_name                                    = "development-load-balancer-1999023657.us-east-1.elb.amazonaws.com"
      + enable_cross_zone_load_balancing            = true
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/development-load-balancer/2ec156ad6d335489"
      + ip_address_type                             = "ipv4"
        name                                        = "development-load-balancer"
        tags                                        = {
            "Environment" = "development"
        }
      + vpc_id                                      = "vpc-00530d07d703d9ec1"
      + zone_id                                     = "Z35SXDOTRQ7X7K"
        # (15 unchanged attributes hidden)

      ~ access_logs {
          - bucket  = "my-tf-test-bucket-kpasdass8838s8dfsd8f93sdf" -> null
          ~ enabled = true -> false
          - prefix  = "test-lb" -> null
        }

      + subnet_mapping {
          + subnet_id = "subnet-002e9d330eddeb30d"
        }
      + subnet_mapping {
          + subnet_id = "subnet-0f938a911467c9bd1"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-0 must be replaced
-/+ resource "aws_instance" "EC2-0" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-09f8c1a75583a4560" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-09f8c1a75583a4560" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0d34c000a6bff8ab6" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-38.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.38" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0da6fd26d822d25f8" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0bcb7bd6e3dd76507" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0bcb7bd6e3dd76507" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0bd9b636e009d7794" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-227.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.227" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-00297947af4ad24d5" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-03e8babefc57a86b0" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-03e8babefc57a86b0" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0418359d578edd3e3" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-244.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.244" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-027b22860f8854f56",
        ]
        tags                                 = {
            "Name" = "EC2-development-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-027b22860f8854f56",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0f490701505393b31" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "my-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-002e9d330eddeb30d",
          + "subnet-0f938a911467c9bd1",
        ]
      + tags                                        = {
          + "Environment" = "dev"
        }
      + tags_all                                    = {
          + "Environment" = "dev"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb.lab will be destroyed
  # (because aws_lb.lab is not in configuration)
  - resource "aws_lb" "lab" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/development-load-balancer/2ec156ad6d335489" -> null
      - arn_suffix                                  = "app/development-load-balancer/2ec156ad6d335489" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "development-load-balancer-1999023657.us-east-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/development-load-balancer/2ec156ad6d335489" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "development-load-balancer" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-027b22860f8854f56",
        ] -> null
      - subnets                                     = [
          - "subnet-002e9d330eddeb30d",
          - "subnet-0f938a911467c9bd1",
        ] -> null
      - tags                                        = {
          - "Environment" = "development"
        } -> null
      - tags_all                                    = {
          - "Environment" = "development"
        } -> null
      - vpc_id                                      = "vpc-00530d07d703d9ec1" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z35SXDOTRQ7X7K" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-002e9d330eddeb30d" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0f938a911467c9bd1" -> null
        }
    }

  # aws_lb_listener.alb_http will be created
  + resource "aws_lb_listener" "alb_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.alb_target_group will be created
  + resource "aws_lb_target_group" "alb_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "my-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
        }
      + tags_all                           = {
          + "Environment" = "dev"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-00530d07d703d9ec1"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.lab-0 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-0" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162801431400000005" -> (known after apply)
      ~ target_id        = "i-09f8c1a75583a4560" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162811270800000006" -> (known after apply)
      ~ target_id        = "i-0bcb7bd6e3dd76507" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/development-lb-tg/b27826972f8d1151-20230414162751786900000004" -> (known after apply)
      ~ target_id        = "i-03e8babefc57a86b0" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.lb_sg will be created
  + resource "aws_security_group" "lb_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "lb-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 10 to add, 0 to change, 7 to destroy.


```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*